tests/perf-analysis/results/tuc-multi-node-4x.txt
          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

     execution: local
        script: ./tests/perf-analysis/test.js
        output: -

     scenarios: (100.00%) 3 scenarios, 16 max VUs, 2m0s max duration (incl. graceful stop):
              * easyNumbers: 8 looping VUs for 30s (exec: easyNumbers, gracefulStop: 30s)
              * mediumNumbers: 8 looping VUs for 30s (exec: mediumNumbers, startTime: 30s, gracefulStop: 30s)
              * hardNumbers: 8 looping VUs for 30s (exec: hardNumbers, startTime: 1m0s, gracefulStop: 30s)


     ✗ status is 200
      ↳  0% — ✓ 0 / ✗ 340320

     checks.....................: 0.00%   ✓ 0           ✗ 340320
     data_received..............: 53 MB   590 kB/s
     data_sent..................: 37 MB   407 kB/s
     easy_response_times........: avg=2.02ms  min=169µs  med=1.43ms  max=66.51ms  p(90)=3.95ms p(95)=5.21ms 
     hard_response_times........: avg=2.02ms  min=178µs  med=1.43ms  max=106.28ms p(90)=3.93ms p(95)=5.19ms 
     http_req_blocked...........: avg=1.67µs  min=0s     med=1µs     max=1.89ms   p(90)=2µs    p(95)=3µs    
     http_req_connecting........: avg=13ns    min=0s     med=0s      max=775µs    p(90)=0s     p(95)=0s     
     http_req_duration..........: avg=2.04ms  min=169µs  med=1.44ms  max=106.28ms p(90)=3.97ms p(95)=5.22ms 
     http_req_failed............: 100.00% ✓ 340320      ✗ 0     
     http_req_receiving.........: avg=22.69µs min=8µs    med=18µs    max=6.35ms   p(90)=34µs   p(95)=46µs   
     http_req_sending...........: avg=7.14µs  min=3µs    med=6µs     max=6.44ms   p(90)=10µs   p(95)=13µs   
     http_req_tls_handshaking...: avg=0s      min=0s     med=0s      max=0s       p(90)=0s     p(95)=0s     
     http_req_waiting...........: avg=2.01ms  min=150µs  med=1.41ms  max=106.21ms p(90)=3.94ms p(95)=5.18ms 
     http_reqs..................: 340320  3780.924993/s
     iteration_duration.........: avg=21.15ms min=7.12ms med=18.21ms max=161.97ms p(90)=33.8ms p(95)=40.07ms
     iterations.................: 34032   378.092499/s
     medium_response_times......: avg=2.07ms  min=184µs  med=1.46ms  max=55.25ms  p(90)=4.04ms p(95)=5.25ms 
     vus........................: 8       min=8         max=8   
     vus_max....................: 16      min=16        max=16  


running (1m30.0s), 00/16 VUs, 34032 complete and 0 interrupted iterations
easyNumbers   ✓ [======================================] 8 VUs  30s
mediumNumbers ✓ [======================================] 8 VUs  30s
hardNumbers   ✓ [======================================] 8 VUs  30s